zBlueBird/temperture/temprature-master-based-on-rtl8762c/src/ble/profile/server/rcu_dfu_service.c
#include <string.h>
#include <gatt.h>
#include <bt_types.h>
#include "trace.h"
#include "gap_le.h"
#include "gap_conn_le.h"
#include "gap_msg.h"
#include "app_msg.h"
#include "flash_device.h"
#include "rtl876x_wdg.h"
#include "rcu_ota_service.h"
#include "rcu_dfu_service.h"
#include "dfu_api.h"
#include "patch_header_check.h"
#include "board.h"
#include "flash_adv_cfg.h"
#include "os_sched.h"
#include "mem_config.h"
#include "otp.h"
#include "rtl876x_hw_aes.h"
#include "patch_header_check.h"
#include "silent_dfu_flash.h"
#include "rcu_application.h"
#include "rcu_gap.h"
#include "os_timer.h"
#include "swtimer.h"
#include "os_sched.h"
#include "app_section.h"
#include "os_sync.h"
#include "platform_utils.h"

#if SUPPORT_SILENT_OTA
/*============================================================================*
 *                              Micro
 *============================================================================*/
/* image header length */
#define IMG_HEADER_SIZE          1024
#define DFU_HEADER_SIZE          12 /*currently, first 12 byte only will be treated as image header*/

/*support flash suspend config: 0 not support, 1 support*/
#define  SUPPORT_ERASE_SUSPEND    0
#if  SUPPORT_ERASE_SUSPEND
#define  BIT_STATUS_SUSPEND       BIT(7)
#define  BIT_STATUS_WEL           BIT(1)
#define  CMD_SECTOR_ERASE         0x20
#endif

/*user data copy config*/
#define  USER_DATA_COPY_EN        0  /*0 disable, 1 enable*/

#define  RCU_STATE_CHECK()        (app_global_data.rcu_status == RCU_STATUS_PAIRED)
#define  RESET_TIME_OUT_TIMER()   os_timer_restart(&dfu_time_out_timer, DFU_PROC_TIME_OUT)
#define  gDfuServiceId            app_global_data.dfu_srv_id
#define  SECTOR_SIZE              0x1000

#define  BIT_STATUS_WIP           BIT(0)

#define  DFU_PROC_TIME_OUT        2000  /* 2s */
/*============================================================================*
 *                              Local Functions
 *============================================================================*/

void silence_BufferCheckProc(uint16_t _mBufferSize, uint16_t _mCrc);
bool sil_dfu_copy_img(uint16_t signature, uint32_t dlAddress, uint32_t dlSize);
void dfu_timer_init(void);
void dfu_process_timeout_timer_callback(TimerHandle_t p_timer);
void dfu_timeout_handle(void);

/*============================================================================*
 *                              External Functions
 *============================================================================*/

bool hw_aes_decrypt_16byte(uint8_t *input, uint8_t *output);

/*============================================================================*
 *                              External Variables
 *============================================================================*/

extern   T_APP_GLOBAL_DATA app_global_data;

/*============================================================================*
 *                              Local Variables
 *============================================================================*/

P_FUN_SERVER_GENERAL_CB pfnDfuExtendedCB = NULL;
const uint8_t   SILENCE_GATT_UUID128_DFU_SERVICE[16] = {0x12, 0xA2, 0x4D, 0x2E, 0xFE, 0x14, 0x48, 0x8e, 0x93, 0xD2, 0x17, 0x3C, 0x87, 0x62, 0x00, 0x00};

bool gOtaValidFlg = false;
uint16_t ota_tmp_buf_used_size;
uint16_t mBufSize;
uint16_t mCrcVal;
uint32_t gSilDfuResendOffset = 0;
uint8_t *g_pOtaTempBufferHead;
uint8_t OtaTempBufferHead[DFU_TEMP_BUFFER_SIZE];

TDFU_CB dfuPara;

/*time out timer*/
TimerHandle_t dfu_time_out_timer;

T_ATTRIB_APPL silence_dfu_service[] =
{

    /*-------------------------- DFU Service ---------------------------*/
    /* <<Primary Service>>, .. */
    {
        (ATTRIB_FLAG_VOID | ATTRIB_FLAG_LE),           /* flags     */
        {
            LO_WORD(GATT_UUID_PRIMARY_SERVICE),
            HI_WORD(GATT_UUID_PRIMARY_SERVICE),              /* type_value */
        },
        UUID_128BIT_SIZE,                                    /* bValueLen     */
        (void *)SILENCE_GATT_UUID128_DFU_SERVICE,           /* p_value_context */
        GATT_PERM_READ                                      /* permissions  */
    },



    /* <<Characteristic>>, .. */
    {
        ATTRIB_FLAG_VALUE_INCL,                     /* flags */
        {                                           /* type_value */
            LO_WORD(GATT_UUID_CHARACTERISTIC),
            HI_WORD(GATT_UUID_CHARACTERISTIC),
            GATT_CHAR_PROP_WRITE_NO_RSP/* characteristic properties */
            /* characteristic UUID not needed here, is UUID of next attrib. */
        },
        1,                                          /* bValueLen */
        NULL,
        GATT_PERM_READ                              /* permissions */
    },
    /*--- DFU packet characteristic value ---*/
    {
        ATTRIB_FLAG_VALUE_APPL | ATTRIB_FLAG_UUID_128BIT,                              /* flags */
        {                                                           /* type_value */
            GATT_UUID128_DFU_PACKET
        },
        0,                                                 /* bValueLen */
        NULL,
        GATT_PERM_WRITE                 /* permissions */
    },
    /* <<Characteristic>>, .. */
    {
        ATTRIB_FLAG_VALUE_INCL,                     /* flags */
        {                                           /* type_value */
            LO_WORD(GATT_UUID_CHARACTERISTIC),
            HI_WORD(GATT_UUID_CHARACTERISTIC),
            (GATT_CHAR_PROP_WRITE |                   /* characteristic properties */
             GATT_CHAR_PROP_NOTIFY)
            /* characteristic UUID not needed here, is UUID of next attrib. */
        },
        1,                                          /* bValueLen */
        NULL,
        GATT_PERM_READ                              /* permissions */
    },
    /*--- DFU Control Point value ---*/
    {
        ATTRIB_FLAG_VALUE_APPL | ATTRIB_FLAG_UUID_128BIT,                              /* flags */
        {                                                           /* type_value */
            GATT_UUID128_DFU_CONTROL_POINT
        },
        0,                                                 /* bValueLen */
        NULL,
        GATT_PERM_WRITE                 /* permissions */
    },
    /* client characteristic configuration */
    {
        (ATTRIB_FLAG_VALUE_INCL |                   /* flags */
         ATTRIB_FLAG_CCCD_APPL),
        {                                           /* type_value */
            LO_WORD(GATT_UUID_CHAR_CLIENT_CONFIG),
            HI_WORD(GATT_UUID_CHAR_CLIENT_CONFIG),
            /* NOTE: this value has an instantiation for each client, a write to */
            /* this attribute does not modify this default value:                */
            LO_WORD(GATT_CLIENT_CHAR_CONFIG_DEFAULT), /* client char. config. bit field */
            HI_WORD(GATT_CLIENT_CHAR_CONFIG_DEFAULT)
        },
        2,                                          /* bValueLen */
        NULL,
        (GATT_PERM_READ | GATT_PERM_WRITE)          /* permissions */
    }

