zBlueBird/temperture/temprature-master-based-on-rtl8762c/src/ble/profile/server/rcu_dfu_service.c
};

/**
 * @brief dfu process time out timer callback
 *
 * @param p_timer - timer handler
 * @return none
 * @retval void
 */
void dfu_process_timeout_timer_callback(TimerHandle_t p_timer) DATA_RAM_FUNCTION;
void dfu_process_timeout_timer_callback(TimerHandle_t p_timer)
{
    /*check dfu time out*/
    if (dfuPara.is_dfu_progressing)
    {
        dfu_timeout_handle();
    }
}

/**
 * @brief dfu process time init
 *
 * @param none
 * @return none
 * @retval void
 */
void dfu_timer_init(void)
{
    /* pair_fail_disconn_timer is used to disconnect for pair failed */
    if (false == os_timer_create(&dfu_time_out_timer, "dfu_time_out_timer",  1, \
                                 DFU_PROC_TIME_OUT, false, dfu_process_timeout_timer_callback))
    {
        APP_PRINT_INFO0("[dfu_timer_init] init dfu_timer_init failed");
    }
}


/**
*  @brief  time out handle for dfu exception stop
*/
void dfu_timeout_handle(void)
{
    DFU_PRINT_INFO0("[DFU] dfu time out handle.");
    dfuPara.is_dfu_progressing = false;
#ifdef NEW_SET_LATENCY_FUNC
    app_set_latency_status(LATENCY_DFU_PROC_BIT, LANTENCY_ON);
#else
    app_set_latency_status(LANTENCY_ON);
#endif
    /*param updata*/

}
/**
*  @brief  check dfu if working
*/
bool  dfu_check_working(void)
{
    return  dfuPara.is_dfu_progressing;
}
/**
 * @brief silence_dfu_service_handle_control_point_req
 *
 * @param length     control point cmd length.
 * @param p_value    control point cmd address..
 * @return None
*/
void  silence_dfu_service_handle_control_point_req(uint16_t length,
                                                   uint8_t *p_value) DATA_RAM_FUNCTION;
void  silence_dfu_service_handle_control_point_req(uint16_t length, uint8_t *p_value)
{
    T_DFU_CTRL_POINT dfu_control_point;
    uint8_t notif_data[9] = {0};

    dfu_control_point.opcode = * p_value;
    uint8_t *p = p_value + 1;

    DFU_PRINT_TRACE2("dfu_service_handle_control_point_req: opcode=0x%x, length=%d",
                     dfu_control_point.opcode, length);

    if (dfu_control_point.opcode >= DFU_OPCODE_MAX || dfu_control_point.opcode <= DFU_OPCODE_MIN)
    {
        notif_data[0] = DFU_OPCODE_NOTIF;
        notif_data[1] = dfu_control_point.opcode;
        notif_data[2] = 0xff;
        server_send_data(0, gDfuServiceId, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                         notif_data, 3, GATT_PDU_TYPE_NOTIFICATION);
        return;
    }

    /*check rcu state*/
    if (!RCU_STATE_CHECK())
    {
        DFU_PRINT_TRACE0("[DFU] err: rcu is not paired.");

        notif_data[0] = DFU_OPCODE_NOTIFICATION;
        notif_data[1] = dfu_control_point.opcode;
        notif_data[2] = DFU_ARV_FAIL_SYS_STATE_ERROR;
        server_send_data(0, gDfuServiceId, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                         notif_data, 3, GATT_PDU_TYPE_NOTIFICATION);
        return;
    }

    switch (dfu_control_point.opcode)
    {
    case DFU_OPCODE_START_DFU: //0x01
        if (length == DFU_LENGTH_START_DFU + 4)/*4 bytes is pending for encrypt*/
        {
            if (OTP->ota_with_encryption_data)
            {
                DFU_PRINT_TRACE1("Data before decryped: %b", TRACE_BINARY(16, p));
#if defined ( __ICCARM__   )
#pragma diag_suppress=Pa039
#endif
                hw_aes_init(OTP->aes_key, NULL, AES_MODE_ECB, OTP->ota_with_encryption_use_aes256);
#if defined ( __ICCARM__   )
#pragma diag_warning=Pa039
#endif
                hw_aes_decrypt_16byte(p, p);
                DFU_PRINT_TRACE1("Data after decryped: %b", TRACE_BINARY(16, p));
            }

            dfu_control_point.p.start_dfu.ic_type = (*p);
            p += 1;
            dfu_control_point.p.start_dfu.secure_version = (*p);
            p += 1;
            LE_ARRAY_TO_UINT16(dfu_control_point.p.start_dfu.ctrl_flag.value, p);
            p += 2;
            LE_ARRAY_TO_UINT16(dfu_control_point.p.start_dfu.signature, p);
            p += 2;
            LE_ARRAY_TO_UINT16(dfu_control_point.p.start_dfu.crc16, p);
            p += 2;
            LE_ARRAY_TO_UINT32(dfu_control_point.p.start_dfu.image_length, p);

            DFU_PRINT_TRACE6("DFU_OPCODE_START_DFU: ic_type=0x%x, secure_version=0x%x, ctrl_flag.value=0x%x, signature=0x%x,crc16=0x%x*4Bytes, image_length=0x%x",
                             dfu_control_point.p.start_dfu.ic_type,
                             dfu_control_point.p.start_dfu.secure_version,
                             dfu_control_point.p.start_dfu.ctrl_flag.value,
                             dfu_control_point.p.start_dfu.signature,
                             dfu_control_point.p.start_dfu.crc16,
                             dfu_control_point.p.start_dfu.image_length
                            );
            dfuPara.ic_type = dfu_control_point.p.start_dfu.ic_type;
            dfuPara.ctrl_flag.value = dfu_control_point.p.start_dfu.ctrl_flag.value;
            dfuPara.signature = dfu_control_point.p.start_dfu.signature;
            // p_dfu->version = dfu_control_point.p.start_dfu.version;
            dfuPara.crc16 = dfu_control_point.p.start_dfu.crc16;
            dfuPara.image_length = dfu_control_point.p.start_dfu.image_length;

            dfuPara.image_total_length = dfuPara.image_length + IMG_HEADER_SIZE;

            /*check if start dfu fileds are vaild*/
            if ((dfuPara.ic_type != 0x05) || (dfuPara.signature < OTA) || (dfuPara.signature > AppData2)
                || (dfuPara.image_total_length > OTP->ota_bank0_size))
            {
                DFU_PRINT_TRACE0("[DFU] err: start dfu fileds are invalid.");

                notif_data[0] = DFU_OPCODE_NOTIFICATION;
                notif_data[1] = DFU_OPCODE_START_DFU;
                notif_data[2] = DFU_ARV_FAIL_INVALID_PARAMETER;
                server_send_data(0, gDfuServiceId, INDEX_DFU_CONTROL_POINT_CHAR_VALUE, \
                                 notif_data, 3, GATT_PDU_TYPE_NOTIFICATION);
                return;
            }

            unlock_flash_all();
            if (sil_dfu_update(dfuPara.signature, 0, DFU_HEADER_SIZE, (uint32_t *)&dfuPara.ic_type) == 0)
            {
                lock_flash();
                dfuPara.nCurOffSet += DFU_HEADER_SIZE;
            }
            else
            {
                lock_flash();
                dfu_reset(dfuPara.signature);
                dfu_fw_active_reset();
            }

            PROFILE_PRINT_INFO0("dfu_act_notify_start_dfu");

