zBlueBird/temperture/temprature-master-based-on-rtl8762c/src/ble/profile/server/rcu_dfu_service.c
    if (dfuPara.nCurOffSet + ota_tmp_buf_used_size + length > dfuPara.image_total_length)
    {
        DFU_PRINT_TRACE4("dfu_service_handle_packet_req: p_dfu->cur_offset=%d, ota_temp_buf_used_size =%d, length= %d, image_total_length = %d ",
                         dfuPara.nCurOffSet,
                         ota_tmp_buf_used_size,
                         length,
                         dfuPara.image_total_length
                        );
        PROFILE_PRINT_INFO0("dfu_act_reset_and_activate");
    }
    else
    {
#if OTA_BUF_CHECK_EN
        {
            memcpy(g_pOtaTempBufferHead + ota_tmp_buf_used_size, p_value, length);
            ota_tmp_buf_used_size += length;
        }
#else
        if (length >= 16)
        {
            if (OTP->ota_with_encryption_data)
            {
                uint16_t offset = 0;
                do
                {
                    if ((length - offset) >= 16)
                    {
                        hw_aes_init(OTP->aes_key, NULL, AES_MODE_ECB, OTP->ota_with_encryption_use_aes256);
                        hw_aes_decrypt_16byte(p_value + offset, p_value + offset);
                        offset += 16;
                    }
                    else
                    {
                        break;
                    }
                }
                while (1);
            }
        }

        memcpy(g_pOtaTempBufferHead + ota_tmp_buf_used_size, p_value, length);
        ota_tmp_buf_used_size += length;

        if (ota_tmp_buf_used_size == (DFU_TEMP_BUFFER_SIZE - DFU_TEMP_BUFFER_SIZE % 20) ||
            dfuPara.nCurOffSet + ota_tmp_buf_used_size == dfuPara.image_total_length
           )
        {
            unlock_flash_all();
            if (sil_dfu_update(dfuPara.signature, dfuPara.nCurOffSet, ota_tmp_buf_used_size,
                               (uint32_t *)g_pOtaTempBufferHead) == 0)
            {
                lock_flash();
            }
            else
            {
                /*eflash write fail, we should restart ota procedure.*/
                lock_flash();
                dfu_reset(dfuPara.signature);
                dfu_fw_active_reset();
            }
            dfuPara.nCurOffSet += ota_tmp_buf_used_size;
            ota_tmp_buf_used_size = 0;
        }
#endif
    }
}

/**
 * @brief write characteristic data from service.
 *
 * @param ServiceID          ServiceID to be written.
 * @param iAttribIndex       Attribute index of characteristic.
 * @param wLength            length of value to be written.
 * @param pValue             value to be written.
 * @return Profile procedure result
*/
T_APP_RESULT dfu_attr_write_cb(uint8_t conn_id, uint8_t service_id,
                               uint16_t attrib_index,
                               T_WRITE_TYPE write_type,
                               uint16_t length, uint8_t *p_value,
                               P_FUN_WRITE_IND_POST_PROC *p_write_ind_post_proc) DATA_RAM_FUNCTION;
T_APP_RESULT dfu_attr_write_cb(uint8_t conn_id, uint8_t service_id,
                               uint16_t attrib_index,
                               T_WRITE_TYPE write_type,
                               uint16_t length, uint8_t *p_value, P_FUN_WRITE_IND_POST_PROC *p_write_ind_post_proc)
{
    T_APP_RESULT  wCause = APP_RESULT_SUCCESS;

    RESET_TIME_OUT_TIMER();

#if FEATURE_SUPPORT_NO_ACTION_DISCONN
    os_timer_restart(&no_act_disconn_timer, NO_ACTION_DISCON_TIMEOUT);
#endif

    if (attrib_index == INDEX_DFU_CONTROL_POINT_CHAR_VALUE)
    {
        silence_dfu_service_handle_control_point_req(/*(T_DFU *)p_dfu, */length, p_value);
    }
    else if (attrib_index == INDEX_DFU_PACKET_VALUE)
    {
        silence_dfu_service_handle_packet_req(/*(T_DFU *)p_dfu, */length, p_value);
    }
    else
    {
        PROFILE_PRINT_INFO1("!!!dfuServiceAttribPut Fail: iAttribIndex=%d.", attrib_index);

        return APP_RESULT_ATTR_NOT_FOUND;

    }
    return wCause;
}

/**
 * @brief update CCCD bits from stack.
 *
 * @param ServiceId          Service ID.
 * @param Index          Attribute index of characteristic data.
 * @param wCCCBits         CCCD bits from stack.
 * @return None
*/
void dfu_cccd_update_cb(uint8_t conn_id, T_SERVER_ID service_id, uint16_t index, uint16_t ccc_bits)
{
    TDFU_CALLBACK_DATA callback_data;
    callback_data.msg_type = SERVICE_CALLBACK_TYPE_INDIFICATION_NOTIFICATION;
    callback_data.conn_id = conn_id;
    bool bHandle = true;
    PROFILE_PRINT_INFO2("DfuCccdUpdateCb  Index = %d wCCCDBits %x", index, ccc_bits);
    switch (index)
    {
    case INDEX_DFU_CHAR_CCCD_INDEX:
        {
            if (ccc_bits & GATT_CLIENT_CHAR_CONFIG_NOTIFY)
            {
                // Enable Notification
                callback_data.msg_type = SERVICE_CALLBACK_TYPE_INDIFICATION_NOTIFICATION;
                callback_data.msg_data.notification_indification_index = DFU_NOTIFY_ENABLE;
            }
            else
            {
                callback_data.msg_type = SERVICE_CALLBACK_TYPE_INDIFICATION_NOTIFICATION;
                callback_data.msg_data.notification_indification_index = DFU_NOTIFY_DISABLE;
            }
            break;
        }
    default:
        {
            bHandle = false;
            break;
        }

    }
    /* Notify Application. */
    if (pfnDfuExtendedCB && (bHandle == true))
    {
        pfnDfuExtendedCB(service_id, (void *)&callback_data);
    }

    return;
}

/**
 * @brief OTA ble Service Callbacks.
*/
const T_FUN_GATT_SERVICE_CBS DfuServiceCBs =
{
    NULL,   // Read callback function pointer
    dfu_attr_write_cb,  // Write callback function pointer
    dfu_cccd_update_cb                    // CCCD update callback function pointer
};

/**
 * @brief  add OTA ble service to application.
 *
 * @param  pFunc          pointer of app callback function called by profile.
 * @return service ID auto generated by profile layer.
 * @retval ServiceId
*/
uint8_t dfu_add_service(void *pFunc)
{
    uint8_t ServiceId;

    if (false == server_add_service(&ServiceId,
                                    (uint8_t *)silence_dfu_service,
                                    sizeof(silence_dfu_service),
                                    DfuServiceCBs))
    {
        PROFILE_PRINT_ERROR1("DFUService_AddService: ServiceId %d", ServiceId);
        ServiceId = 0xff;
        return ServiceId;
    }
    pfnDfuExtendedCB = (P_FUN_SERVER_GENERAL_CB)pFunc;
    /*dfu timer init*/
    dfu_timer_init();
    g_pOtaTempBufferHead = OtaTempBufferHead;
    return ServiceId;
}


#endif  // #if SUPPORT_SILENT_OTA
